tests/informe_html/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 7500,
    "errorCount" : 7,
    "errorPct" : 0.093333334,
    "meanResTime" : 255.07573333333391,
    "medianResTime" : 21.0,
    "minResTime" : 1.0,
    "maxResTime" : 1614.0,
    "pct1ResTime" : 1026.9000000000005,
    "pct2ResTime" : 1181.0,
    "pct3ResTime" : 1365.9899999999998,
    "throughput" : 92.00873469588046,
    "receivedKBytesPerSec" : 312.2401711669161,
    "sentKBytesPerSec" : 27.432955343560618
  },
  "3. GET /health" : {
    "transaction" : "3. GET /health",
    "sampleCount" : 2500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.388799999999996,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 10.0,
    "throughput" : 31.29655362351498,
    "receivedKBytesPerSec" : 33.40540342822448,
    "sentKBytesPerSec" : 5.56247339792942
  },
  "1. POST /login" : {
    "transaction" : "1. POST /login",
    "sampleCount" : 2500,
    "errorCount" : 7,
    "errorPct" : 0.28,
    "meanResTime" : 740.628400000002,
    "medianResTime" : 817.5,
    "minResTime" : 85.0,
    "maxResTime" : 1614.0,
    "pct1ResTime" : 1252.0,
    "pct2ResTime" : 1333.0,
    "pct3ResTime" : 1443.9899999999998,
    "throughput" : 31.971762539325265,
    "receivedKBytesPerSec" : 49.16271698835588,
    "sentKBytesPerSec" : 8.148378352239302
  },
  "2. GET /documentos" : {
    "transaction" : "2. GET /documentos",
    "sampleCount" : 2500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.209999999999965,
    "medianResTime" : 21.0,
    "minResTime" : 11.0,
    "maxResTime" : 96.0,
    "pct1ResTime" : 25.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 39.0,
    "throughput" : 31.677246867120285,
    "receivedKBytesPerSec" : 239.97743045656415,
    "sentKBytesPerSec" : 14.63082940535472
  }
}